(function () {
    var categories = {
    saveSettings: "সব প্রত্যাখ্যান করুন",
    necessary: {
        title: "প্রয়োজনীয়",
        description: "প্রয়োজনীয় ওয়েব প্রযুক্তি এবং কুকি আমাদের ওয়েবসাইটকে আপনার জন্য অ্যাক্সেসযোগ্য ও কার্যকরী করার জন্য অপরিহার্য। এগুলো নেভিগেশন, আপনার ব্রাউজারে সঠিক প্রদর্শন এবং আপনার সম্মতির পছন্দ পরিচালনার মতো মূল বৈশিষ্ট্যগুলো সক্ষম করে। এই প্রযুক্তি ও কুকি ছাড়া, আমাদের ওয়েবসাইট সঠিকভাবে কাজ করতে পারে না।"
    },
    functional: {
        title: "কার্যকরী",
        description: "কার্যকরী কুকিগুলো আমাদের এমন তথ্য সংরক্ষণ করতে দেয় যা ওয়েবসাইটের চেহারা বা আচরণ পরিবর্তন করে, যেমন আপনার পছন্দের ভাষা বা অঞ্চল।"
    },
    statisic: {
        title: "অ্যানালিটিক্স",
        description: "আমরা আমাদের ওয়েবসাইটের ব্যবহারকারীর অভিজ্ঞতা এবং কর্মক্ষমতা ক্রমাগত উন্নত করার চেষ্টা করি। এর জন্য, আমরা বিশ্লেষণাত্মক প্রযুক্তি (কুকি সহ) ব্যবহার করি যা বেনামে পরিমাপ ও মূল্যায়ন করে যে আমাদের ওয়েবসাইটের কোন বৈশিষ্ট্য ও বিষয়বস্তু কীভাবে এবং কতবার ব্যবহৃত হয়। এই তথ্য আমাদের ব্যবহারকারীদের জন্য সাইটটি উন্নত করতে সাহায্য করে।"
    },
    marketing: {
        title: "মার্কেটিং",
        description: "আমরা বিশ্বস্ত অংশীদারদের ওয়েব প্রযুক্তি (কুকি সহ) ব্যবহার করি যাতে ওয়েবসাইট ও সামাজিক মাধ্যম প্ল্যাটফর্মে আপনার জন্য বিশেষভাবে তৈরি বিষয়বস্তু ও বিজ্ঞাপন প্রদান করা যায়। এই বিষয়বস্তু আপনার ব্রাউজিং আচরণের ভিত্তিতে নির্বাচিত ও প্রদর্শিত হয়। বিজ্ঞাপন ও মার্কেটিং কুকিগুলো প্রাসঙ্গিক বিজ্ঞাপন ও প্রচারাভিযান দেখাতে, বিভিন্ন সাইটে দর্শকদের ট্র্যাক করতে এবং ব্যক্তিগতকৃত বিজ্ঞাপন উপস্থাপনের জন্য তথ্য সংগ্রহ করতে ব্যবহৃত হয়।"
    },
    security: {
        title: "নিরাপত্তা",
        description: "নিরাপত্তা কুকিগুলো নিরাপত্তা ঝুঁকি চিহ্নিত ও প্রতিরোধ করতে, প্রতারণামূলক কার্যকলাপ শনাক্ত করতে এবং আমাদের ওয়েবসাইট ও এর ব্যবহারকারীদের সুরক্ষিত রাখতে সাহায্য করে।"
    },
    unclassified: {
        title: "অশ্রেণিবদ্ধ",
        description: "যে কুকিগুলো এখনও কোনো বিভাগে শ্রেণিবদ্ধ করা হয়নি সেগুলো এখানে তালিকাভুক্ত করা হয়েছে। আমরা এই পৃথক কুকিগুলোর প্রদানকারীদের সাথে মিলে সেগুলো শ্রেণিবদ্ধ করার কাজ করছি।"
    }
};
    var arrangeWord = (window.INTA && window.INTA.settings && window.INTA.settings.arrange == "ltr") ? "বাম" : "ডান";
    window.__intaCmpLocalePayload = {
        slug: "bn",
        cookieSettingsLabel: "কুকি সেটিংস",
        showHideDetails: "বিস্তারিত দেখান",
        acceptLabel: "গ্রহণ করুন",
        acceptShortLabel: "গ্রহণ করুন",
        declineLabel: "সব প্রত্যাখ্যান করুন",
        settingsLabel: "সেটিংস",
        policyLinkLabel: "আমাদের গোপনীয়তা ও কুকি নীতি",
        bannerMessage: "সমস্ত কুকি গ্রহণ করে, আপনি " + document.domain + "-কে আপনার জন্য একটি ভালো সমাধান তৈরি করতে সহায়তা করছেন।</p><p>আপনি কি শুধুমাত্র প্রয়োজনীয় কুকি অনুমোদন করতে চান নাকি সমস্ত কুকি অনুমোদন করতে চান তা নির্বাচন করুন।",
        settingsMessage: "<h3 style=\"    font-size: 25px;\">নিয়ন্ত্রণ আপনার হাতে</h3>"
            + "<p>আমরা এবং আমাদের বিশ্বস্ত অংশীদাররা বিভিন্ন উদ্দেশ্যে তথ্য সংগ্রহ করতে কুকির মতো প্রযুক্তি ব্যবহার করি, যার মধ্যে রয়েছে:</p>"
            + "<ol>"
            + "<li>কার্যকরী</li>"
            + "<li>অ্যানালিটিক্স</li>"
            + "<li>মার্কেটিং</li>"
            + "</ol>"
            + "<p>'গ্রহণ করুন'-এ ক্লিক করে, আপনি এই সমস্ত উদ্দেশ্যে সম্মতি দেন। বিকল্পভাবে, চেকবক্স চিহ্নিত করে এবং 'সেটিংস সংরক্ষণ করুন'-এ ক্লিক করে আপনি যে নির্দিষ্ট উদ্দেশ্যগুলোতে সম্মত তা নির্বাচন করতে পারেন।</p>"
            + "<p>আপনি ওয়েবসাইটের নিচের " + arrangeWord + " কোণায় থাকা ছোট আইকনে ক্লিক করে যেকোনো সময় আপনার সম্মতি প্রত্যাহার করতে পারেন।</p>",
        settingsMessageSuffix: '<button onClick="showPrivacy()" class="intastellarCookie-settings__privacyLink">Intastellar Solutions, International-এর গোপনীয়তা নীতি</button>',
        categories: categories
    };
})();
