(function () {
    var categories = {
    saveSettings: "رد همه",
    necessary: {
        title: "ضروری",
        description: "فناوری‌های وب و کوکی‌های ضروری برای در دسترس و کاربردی بودن وب‌سایت ما برای شما اساسی هستند. این موارد امکانات کلیدی مانند پیمایش، نمایش صحیح در مرورگر شما و مدیریت تنظیمات رضایت شما را فراهم می‌کنند. بدون این فناوری‌ها و کوکی‌ها، وب‌سایت ما نمی‌تواند به درستی کار کند."
    },
    functional: {
        title: "کارکردی",
        description: "کوکی‌های کارکردی به ما امکان می‌دهند اطلاعاتی را ذخیره کنیم که ظاهر یا رفتار وب‌سایت را تغییر می‌دهد، مانند زبان یا منطقه مورد نظر شما."
    },
    statisic: {
        title: "تحلیلی",
        description: "ما تلاش می‌کنیم تجربه کاربری و عملکرد وب‌سایت خود را به‌طور مداوم بهبود بخشیم. برای این منظور، از فناوری‌های تحلیلی (از جمله کوکی‌ها) استفاده می‌کنیم که به‌صورت ناشناس اندازه‌گیری و ارزیابی می‌کنند کدام ویژگی‌ها و محتوای وب‌سایت ما، چگونه و چند بار استفاده می‌شوند. این داده‌ها به ما کمک می‌کند سایت را برای کاربران بهبود بخشیم."
    },
    marketing: {
        title: "بازاریابی",
        description: "ما از فناوری‌های وب (از جمله کوکی‌ها) از شرکای مورد اعتماد استفاده می‌کنیم تا محتوا و تبلیغاتی متناسب با شما را در وب‌سایت‌ها و پلتفرم‌های رسانه‌های اجتماعی ارائه دهیم. این محتوا بر اساس رفتار مرور شما انتخاب و نمایش داده می‌شود. کوکی‌های تبلیغاتی و بازاریابی برای نمایش تبلیغات و کمپین‌های مرتبط، ردیابی بازدیدکنندگان در سایت‌های مختلف و جمع‌آوری اطلاعات برای ارائه تبلیغات شخصی‌سازی‌شده استفاده می‌شوند."
    },
    security: {
        title: "امنیت",
        description: "کوکی‌های امنیتی به شناسایی و پیشگیری از خطرات امنیتی، شناسایی فعالیت‌های متقلبانه و محافظت از وب‌سایت ما و کاربران آن کمک می‌کنند."
    },
    unclassified: {
        title: "دسته‌بندی‌نشده",
        description: "کوکی‌هایی که هنوز در هیچ دسته‌ای طبقه‌بندی نشده‌اند در اینجا فهرست شده‌اند. ما در حال همکاری با ارائه‌دهندگان این کوکی‌های جداگانه برای طبقه‌بندی آن‌ها هستیم."
    }
};
    var arrangeWord = (window.INTA && window.INTA.settings && window.INTA.settings.arrange == "ltr") ? "چپ" : "راست";
    window.__intaCmpLocalePayload = {
        slug: "fa",
        cookieSettingsLabel: "تنظیمات کوکی",
        showHideDetails: "نمایش جزئیات",
        acceptLabel: "پذیرفتن",
        acceptShortLabel: "پذیرفتن",
        declineLabel: "رد همه",
        settingsLabel: "تنظیمات",
        policyLinkLabel: "خط‌مشی حریم خصوصی و کوکی ما",
        bannerMessage: "با پذیرفتن همه کوکی‌ها، از " + document.domain + " در توسعه راهکاری بهتر برای شما حمایت می‌کنید.</p><p>انتخاب کنید که آیا می‌خواهید فقط کوکی‌های ضروری را مجاز کنید یا همه کوکی‌ها را.",
        settingsMessage: "<h3 style=\"    font-size: 25px;\">کنترل با شماست</h3>"
            + "<p>ما و شرکای مورد اعتماد ما از فناوری‌هایی مانند کوکی‌ها برای جمع‌آوری اطلاعات به منظورهای مختلف استفاده می‌کنیم، از جمله:</p>"
            + "<ol>"
            + "<li>کارکردی</li>"
            + "<li>تحلیلی</li>"
            + "<li>بازاریابی</li>"
            + "</ol>"
            + "<p>با کلیک روی «پذیرفتن»، شما با تمام این اهداف موافقت می‌کنید. همچنین می‌توانید با علامت زدن کادرها و کلیک روی «ذخیره تنظیمات»، اهداف خاصی را که با آن‌ها موافقید انتخاب کنید.</p>"
            + "<p>می‌توانید در هر زمان با کلیک روی نماد کوچک در گوشه پایین " + arrangeWord + " وب‌سایت، رضایت خود را پس بگیرید.</p>",
        settingsMessageSuffix: '<button onClick="showPrivacy()" class="intastellarCookie-settings__privacyLink">خط‌مشی حریم خصوصی Intastellar Solutions, International</button>',
        categories: categories
    };
})();
