(function () {
    var categories = {
    saveSettings: "सभी अस्वीकार करें",
    necessary: {
        title: "आवश्यक",
        description: "आवश्यक वेब तकनीकें और कुकीज़ हमारी वेबसाइट को आपके लिए सुलभ और कार्यात्मक बनाने के लिए आवश्यक हैं। ये नेविगेशन, आपके ब्राउज़र में सही प्रदर्शन, और आपकी सहमति प्राथमिकताओं के प्रबंधन जैसी प्रमुख सुविधाओं को सक्षम करती हैं। इन तकनीकों और कुकीज़ के बिना, हमारी वेबसाइट ठीक से काम नहीं कर सकती।"
    },
    functional: {
        title: "कार्यात्मक",
        description: "कार्यात्मक कुकीज़ हमें ऐसी जानकारी संग्रहीत करने देती हैं जो वेबसाइट के दिखने या व्यवहार करने के तरीके को बदल देती है, जैसे आपकी पसंदीदा भाषा या क्षेत्र।"
    },
    statisic: {
        title: "एनालिटिक्स",
        description: "हम अपनी वेबसाइट के उपयोगकर्ता अनुभव और प्रदर्शन को लगातार बेहतर बनाने का प्रयास करते हैं। इसके लिए, हम विश्लेषणात्मक तकनीकों (कुकीज़ सहित) का उपयोग करते हैं जो गुमनाम रूप से मापती और आकलन करती हैं कि हमारी वेबसाइट की कौन सी सुविधाओं और सामग्री का उपयोग कैसे, कब और कितनी बार किया जाता है। यह डेटा हमें उपयोगकर्ताओं के लिए अपनी साइट बेहतर बनाने में मदद करता है।"
    },
    marketing: {
        title: "मार्केटिंग",
        description: "हम विश्वसनीय साझेदारों की वेब तकनीकों (कुकीज़ सहित) का उपयोग वेबसाइटों और सोशल मीडिया प्लेटफ़ॉर्म पर आपके लिए विशेष रूप से तैयार की गई सामग्री और विज्ञापन प्रदान करने के लिए करते हैं। यह सामग्री आपके ब्राउज़िंग व्यवहार के आधार पर चुनी और प्रदर्शित की जाती है। विज्ञापन और मार्केटिंग कुकीज़ का उपयोग प्रासंगिक विज्ञापन और अभियान दिखाने, विभिन्न साइटों पर आगंतुकों को ट्रैक करने, और व्यक्तिगत विज्ञापन प्रस्तुत करने के लिए जानकारी एकत्र करने हेतु किया जाता है।"
    }
};
    var arrangeWord = (window.INTA && window.INTA.settings && window.INTA.settings.arrange == "ltr") ? "बाएं" : "दाएं";
    window.__intaCmpLocalePayload = {
        slug: "hi",
        cookieSettingsLabel: "कुकी सेटिंग्स",
        showHideDetails: "विवरण दिखाएं",
        acceptLabel: "स्वीकार करें",
        acceptShortLabel: "स्वीकार करें",
        declineLabel: "सभी अस्वीकार करें",
        settingsLabel: "सेटिंग्स",
        policyLinkLabel: "हमारी गोपनीयता और कुकी नीति",
        bannerMessage: "सभी कुकीज़ स्वीकार करके, आप " + document.domain + " को आपके लिए एक बेहतर समाधान विकसित करने में सहयोग देते हैं।</p><p>चुनें कि क्या आप केवल आवश्यक कुकीज़ की अनुमति देना चाहते हैं या सभी कुकीज़ की अनुमति देना चाहते हैं।",
        settingsMessage: "<h3 style=\"    font-size: 25px;\">आप नियंत्रण में हैं</h3>"
            + "<p>हम और हमारे विश्वसनीय साझेदार विभिन्न उद्देश्यों के लिए जानकारी एकत्र करने हेतु कुकीज़ जैसी तकनीकों का उपयोग करते हैं, जिनमें शामिल हैं:</p>"
            + "<ol>"
            + "<li>कार्यात्मक</li>"
            + "<li>एनालिटिक्स</li>"
            + "<li>मार्केटिंग</li>"
            + "</ol>"
            + "<p>'स्वीकार करें' पर क्लिक करके, आप इन सभी उद्देश्यों के लिए सहमति देते हैं। वैकल्पिक रूप से, आप चेकबॉक्स को चिह्नित करके और 'सेटिंग्स सहेजें' पर क्लिक करके उन विशिष्ट उद्देश्यों का चयन कर सकते हैं जिनसे आप सहमत हैं।</p>"
            + "<p>आप वेबसाइट के निचले " + arrangeWord + " कोने में छोटे आइकन पर क्लिक करके किसी भी समय अपनी सहमति वापस ले सकते हैं।</p>",
        settingsMessageSuffix: '<button onClick="showPrivacy()" class="intastellarCookie-settings__privacyLink">Intastellar Solutions, International गोपनीयता नीति</button>',
        categories: categories
    };
})();
