(function () {
    var categories = {
    saveSettings: "Одбиј све",
    necessary: {
        title: "Неопходни",
        description: "Неопходне веб технологије и колачићи су неопходни да би наш сајт био доступан и функционалан за вас. Они омогућавају кључне функције, као што су навигација, исправан приказ у вашем прегледачу и управљање вашим подешавањима сагласности. Без ових технологија и колачића, наш сајт не може исправно да функционише."
    },
    functional: {
        title: "Функционални",
        description: "Функционални колачићи нам омогућавају да чувамо информације које мењају изглед или понашање сајта, као што су ваш жељени језик или регион."
    },
    statisic: {
        title: "Аналитика",
        description: "Стално настојимо да побољшамо корисничко искуство и перформансе нашег сајта. Да бисмо то постигли, користимо аналитичке технологије (укључујући колачиће) које псеудонимно мере и процењују које функције и садржај нашег сајта се користе, како и колико често. Ови подаци нам помажу да побољшамо сајт за кориснике."
    },
    marketing: {
        title: "Маркетинг",
        description: "Користимо веб технологије (укључујући колачиће) од поузданих партнера да бисмо вам приказали садржај и рекламе прилагођене посебно вама на веб сајтовима и платформама друштвених медија. Овај садржај се бира и приказује на основу вашег понашања приликом прегледања. Рекламни и маркетиншки колачићи се користе за приказивање релевантних реклама и кампања, праћење посетилаца на различитим сајтовима и прикупљање информација за приказивање персонализованих реклама."
    },
    security: {
        title: "Безбедност",
        description: "Безбедносни колачићи помажу у идентификовању и спречавању безбедносних ризика, откривању преварних активности и заштити нашег сајта и његових корисника."
    },
    unclassified: {
        title: "Некатегорисани",
        description: "Овде су наведени колачићи који још увек нису сврстани у категорију. Сарађујемо са добављачима ових појединачних колачића како бисмо их категорисали."
    }
};
    var arrangeWord = (window.INTA && window.INTA.settings && window.INTA.settings.arrange == "ltr") ? "левом" : "десном";
    window.__intaCmpLocalePayload = {
        slug: "sr",
        cookieSettingsLabel: "Подешавања колачића",
        showHideDetails: "Прикажи детаље",
        acceptLabel: "Прихвати",
        acceptShortLabel: "Прихвати",
        declineLabel: "Одбиј све",
        settingsLabel: "Подешавања",
        policyLinkLabel: "Наша политика приватности и колачића",
        bannerMessage: "Прихватањем свих колачића подржавате " + document.domain + " у развоју бољег решења за вас.</p><p>Изаберите да ли желите да дозволите само неопходне колачиће или да дозволите све колачиће.",
        settingsMessage: "<h3 style=\"    font-size: 25px;\">Ви имате контролу</h3>"
            + "<p>Ми и наши поуздани партнери користимо технологије, попут колачића, да бисмо прикупљали информације у различите сврхе, укључујући:</p>"
            + "<ol>"
            + "<li>Функционални</li>"
            + "<li>Аналитика</li>"
            + "<li>Маркетинг</li>"
            + "</ol>"
            + "<p>Кликом на „Прихвати” пристајете на све ове сврхе. Алтернативно, можете изабрати одређене сврхе са којима се слажете тако што ћете означити поља и кликнути на „Сачувај подешавања”.</p>"
            + "<p>Своју сагласност можете повући у било ком тренутку кликом на малу иконицу у доњем " + arrangeWord + " углу сајта.</p>",
        settingsMessageSuffix: '<button onClick="showPrivacy()" class="intastellarCookie-settings__privacyLink">Политика приватности компаније Intastellar Solutions, International</button>',
        categories: categories
    };
})();
