(function () {
    var categories = {
    saveSettings: "அனைத்தையும் நிராகரி",
    necessary: {
        title: "அவசியமானவை",
        description: "எங்கள் இணையதளத்தை உங்களுக்கு அணுகக்கூடியதாகவும் செயல்படக்கூடியதாகவும் மாற்ற அவசியமான வலை தொழில்நுட்பங்களும் குக்கீகளும் இன்றியமையாதவை. வழிசெலுத்தல், உங்கள் உலாவியில் சரியான காட்சி, மற்றும் உங்கள் ஒப்புதல் விருப்பங்களை நிர்வகித்தல் போன்ற முக்கிய அம்சங்களை இவை செயல்படுத்துகின்றன. இந்த தொழில்நுட்பங்களும் குக்கீகளும் இல்லாமல், எங்கள் இணையதளம் சரியாக செயல்பட முடியாது."
    },
    functional: {
        title: "செயல்பாட்டு",
        description: "செயல்பாட்டு குக்கீகள் இணையதளத்தின் தோற்றத்தை அல்லது நடத்தையை மாற்றும் தகவல்களை சேமிக்க எங்களை அனுமதிக்கின்றன, உதாரணமாக உங்கள் விருப்பமான மொழி அல்லது பிராந்தியம்."
    },
    statisic: {
        title: "பகுப்பாய்வு",
        description: "எங்கள் இணையதளத்தின் பயனர் அனுபவத்தையும் செயல்திறனையும் தொடர்ந்து மேம்படுத்த நாங்கள் முயல்கிறோம். இதற்காக, எங்கள் இணையதளத்தின் எந்த அம்சங்களும் உள்ளடக்கமும் எவ்வாறு, எப்போது பயன்படுத்தப்படுகின்றன என்பதை புனைப்பெயரில் அளவிடும் மற்றும் மதிப்பிடும் பகுப்பாய்வு தொழில்நுட்பங்களை (குக்கீகள் உட்பட) பயன்படுத்துகிறோம். இந்த தரவு பயனர்களுக்காக எங்கள் தளத்தை மேம்படுத்த உதவுகிறது."
    },
    marketing: {
        title: "சந்தைப்படுத்தல்",
        description: "நம்பகமான கூட்டாளர்களிடமிருந்து வலை தொழில்நுட்பங்களை (குக்கீகள் உட்பட) பயன்படுத்தி, இணையதளங்களிலும் சமூக ஊடக தளங்களிலும் உங்களுக்கென தனிப்பயனாக்கப்பட்ட உள்ளடக்கம் மற்றும் விளம்பரங்களை வழங்குகிறோம். இந்த உள்ளடக்கம் உங்கள் உலாவல் நடத்தையின் அடிப்படையில் தேர்ந்தெடுக்கப்பட்டு காட்டப்படுகிறது. தொடர்புடைய விளம்பரங்கள் மற்றும் பிரச்சாரங்களைக் காட்ட, பல்வேறு தளங்களில் பார்வையாளர்களைக் கண்காணிக்க, மற்றும் தனிப்பயனாக்கப்பட்ட விளம்பரங்களை வழங்க தகவல்களை சேகரிக்க விளம்பர மற்றும் சந்தைப்படுத்தல் குக்கீகள் பயன்படுத்தப்படுகின்றன."
    }
};
    var arrangeWord = (window.INTA && window.INTA.settings && window.INTA.settings.arrange == "ltr") ? "இடது" : "வலது";
    window.__intaCmpLocalePayload = {
        slug: "ta",
        cookieSettingsLabel: "குக்கீ அமைப்புகள்",
        showHideDetails: "விவரங்களைக் காட்டு",
        acceptLabel: "ஏற்கவும்",
        acceptShortLabel: "ஏற்கவும்",
        declineLabel: "அனைத்தையும் நிராகரி",
        settingsLabel: "அமைப்புகள்",
        policyLinkLabel: "எங்கள் தனியுரிமை மற்றும் குக்கீ கொள்கை",
        bannerMessage: "அனைத்து குக்கீகளையும் ஏற்பதன் மூலம், " + document.domain + " உங்களுக்கு சிறந்த தீர்வை உருவாக்குவதில் நீங்கள் ஆதரவளிக்கிறீர்கள்.</p><p>அவசியமான குக்கீகளை மட்டும் அனுமதிக்க விரும்புகிறீர்களா அல்லது அனைத்து குக்கீகளையும் அனுமதிக்க விரும்புகிறீர்களா என்பதை தேர்ந்தெடுக்கவும்.",
        settingsMessage: "<h3 style=\"    font-size: 25px;\">கட்டுப்பாடு உங்களிடம் உள்ளது</h3>"
            + "<p>நாங்களும் எங்கள் நம்பகமான கூட்டாளர்களும் பல்வேறு நோக்கங்களுக்காக தகவல்களை சேகரிக்க குக்கீகள் போன்ற தொழில்நுட்பங்களைப் பயன்படுத்துகிறோம், அவற்றில்:</p>"
            + "<ol>"
            + "<li>செயல்பாட்டு</li>"
            + "<li>பகுப்பாய்வு</li>"
            + "<li>சந்தைப்படுத்தல்</li>"
            + "</ol>"
            + "<p>'ஏற்கவும்' என்பதை கிளிக் செய்வதன் மூலம், இந்த நோக்கங்கள் அனைத்திற்கும் நீங்கள் ஒப்புதல் அளிக்கிறீர்கள். மாற்றாக, தேர்வு பெட்டிகளை குறித்து 'அமைப்புகளை சேமி' என்பதை கிளிக் செய்வதன் மூலம் நீங்கள் ஒப்புக்கொள்ளும் குறிப்பிட்ட நோக்கங்களை தேர்ந்தெடுக்கலாம்.</p>"
            + "<p>இணையதளத்தின் கீழ் " + arrangeWord + " மூலையில் உள்ள சிறிய ஐகானைக் கிளிக் செய்வதன் மூலம் எந்த நேரத்திலும் உங்கள் ஒப்புதலை திரும்பப் பெறலாம்.</p>",
        settingsMessageSuffix: '<button onClick="showPrivacy()" class="intastellarCookie-settings__privacyLink">Intastellar Solutions, International தனியுரிமைக் கொள்கை</button>',
        categories: categories
    };
})();
