(function () {
    var categories = {
    saveSettings: "سب مسترد کریں",
    necessary: {
        title: "ضروری",
        description: "ضروری ویب ٹیکنالوجیز اور کوکیز ہماری ویب سائٹ کو آپ کے لیے قابل رسائی اور فعال بنانے کے لیے ضروری ہیں۔ یہ نیویگیشن، آپ کے براؤزر میں درست ڈسپلے، اور آپ کی رضامندی کی ترجیحات کے انتظام جیسی اہم خصوصیات کو ممکن بناتی ہیں۔ ان ٹیکنالوجیز اور کوکیز کے بغیر، ہماری ویب سائٹ صحیح طریقے سے کام نہیں کر سکتی۔"
    },
    functional: {
        title: "فعالیتی",
        description: "فعالیتی کوکیز ہمیں ایسی معلومات محفوظ کرنے دیتی ہیں جو ویب سائٹ کی ظاہری شکل یا رویے کو تبدیل کرتی ہیں، جیسے آپ کی پسندیدہ زبان یا علاقہ۔"
    },
    statisic: {
        title: "تجزیات",
        description: "ہم اپنی ویب سائٹ کے صارف کے تجربے اور کارکردگی کو مسلسل بہتر بنانے کی کوشش کرتے ہیں۔ اس کے لیے، ہم تجزیاتی ٹیکنالوجیز (بشمول کوکیز) استعمال کرتے ہیں جو گمنام طور پر ناپتی اور جانچتی ہیں کہ ہماری ویب سائٹ کی کون سی خصوصیات اور مواد استعمال ہوتے ہیں، کیسے، اور کتنی بار۔ یہ ڈیٹا ہمیں صارفین کے لیے اپنی سائٹ بہتر بنانے میں مدد دیتا ہے۔"
    },
    marketing: {
        title: "مارکیٹنگ",
        description: "ہم قابل اعتماد شراکت داروں کی ویب ٹیکنالوجیز (بشمول کوکیز) استعمال کرتے ہیں تاکہ ویب سائٹس اور سوشل میڈیا پلیٹ فارمز پر آپ کے لیے خاص طور پر تیار کردہ مواد اور اشتہارات فراہم کر سکیں۔ یہ مواد آپ کے براؤزنگ رویے کی بنیاد پر منتخب اور ظاہر کیا جاتا ہے۔ اشتہاری اور مارکیٹنگ کوکیز متعلقہ اشتہارات اور مہمات دکھانے، مختلف سائٹس پر زائرین کو ٹریک کرنے، اور ذاتی نوعیت کے اشتہارات پیش کرنے کے لیے معلومات جمع کرنے کے لیے استعمال ہوتی ہیں۔"
    }
};
    var arrangeWord = (window.INTA && window.INTA.settings && window.INTA.settings.arrange == "ltr") ? "بائیں" : "دائیں";
    window.__intaCmpLocalePayload = {
        slug: "ur",
        cookieSettingsLabel: "کوکی کی ترتیبات",
        showHideDetails: "تفصیلات دکھائیں",
        acceptLabel: "قبول کریں",
        acceptShortLabel: "قبول کریں",
        declineLabel: "سب مسترد کریں",
        settingsLabel: "ترتیبات",
        policyLinkLabel: "ہماری رازداری اور کوکی پالیسی",
        bannerMessage: "تمام کوکیز کو قبول کرکے، آپ " + document.domain + " کو آپ کے لیے بہتر حل تیار کرنے میں مدد دیتے ہیں۔</p><p>منتخب کریں کہ کیا آپ صرف ضروری کوکیز کی اجازت دینا چاہتے ہیں یا تمام کوکیز کی اجازت دینا چاہتے ہیں۔",
        settingsMessage: "<h3 style=\"    font-size: 25px;\">کنٹرول آپ کے ہاتھ میں ہے</h3>"
            + "<p>ہم اور ہمارے قابل اعتماد شراکت دار مختلف مقاصد کے لیے معلومات جمع کرنے کے لیے کوکیز جیسی ٹیکنالوجیز استعمال کرتے ہیں، جن میں شامل ہیں:</p>"
            + "<ol>"
            + "<li>فعالیتی</li>"
            + "<li>تجزیات</li>"
            + "<li>مارکیٹنگ</li>"
            + "</ol>"
            + "<p>'قبول کریں' پر کلک کرکے، آپ ان تمام مقاصد کے لیے رضامندی دیتے ہیں۔ متبادل کے طور پر، آپ چیک باکسز کو نشان زد کرکے اور 'ترتیبات محفوظ کریں' پر کلک کرکے مخصوص مقاصد کا انتخاب کر سکتے ہیں جن سے آپ متفق ہیں۔</p>"
            + "<p>آپ کسی بھی وقت ویب سائٹ کے نیچے " + arrangeWord + " کونے میں موجود چھوٹے آئیکن پر کلک کرکے اپنی رضامندی واپس لے سکتے ہیں۔</p>",
        settingsMessageSuffix: '<button onClick="showPrivacy()" class="intastellarCookie-settings__privacyLink">Intastellar Solutions, International کی رازداری کی پالیسی</button>',
        categories: categories
    };
})();
